#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_vpc.vpc: Refreshing state... [id=vpc-092debea3254331ba]
aws_eip.eip_02: Refreshing state... [id=eipalloc-04be74ab21637e9dd]
aws_eip.eip_01: Refreshing state... [id=eipalloc-052e6910778018a2b]
data.aws_iam_policy_document.assume_role: Reading...
aws_iam_role.iam_role_eks_node_group: Refreshing state... [id=earth-dev-eks-node-group-role]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3552664922]
aws_iam_role.iam_role_eks: Refreshing state... [id=earth-dev-eks-cluster-role]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=earth-dev-eks-cluster-role-20231013044948078300000001]
aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=earth-dev-eks-cluster-role-20231013044948080500000002]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=earth-dev-eks-node-group-role-20231013044948195100000003]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=earth-dev-eks-node-group-role-20231013044948198700000004]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=earth-dev-eks-node-group-role-20231013044948319700000005]
aws_iam_role_policy.iam_role_policy_s3: Refreshing state... [id=earth-dev-eks-node-group-role:s3_policy]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-050e4e0a4685d8489]
aws_subnet.private_subnet_02: Refreshing state... [id=subnet-05012dac422b664b4]
aws_subnet.public_subnet_01: Refreshing state... [id=subnet-02f746a08232c35d4]
aws_security_group.cluster_sg: Refreshing state... [id=sg-0be7c4090e74672fa]
aws_subnet.private_subnet_01: Refreshing state... [id=subnet-08df4cd5293a0f9de]
aws_subnet.public_subnet_02: Refreshing state... [id=subnet-0ab5ed9a87851efa2]
aws_route_table.public_route_table: Refreshing state... [id=rtb-03d909ea7d9368e61]
aws_nat_gateway.nat_gateway_01: Refreshing state... [id=nat-014d494fbc0991360]
aws_launch_template.app_node: Refreshing state... [id=lt-0b5746690741556e7]
aws_eks_cluster.eks_cluster: Refreshing state... [id=earth-dev]
aws_nat_gateway.nat_gateway_02: Refreshing state... [id=nat-0498d593ea7217d7c]
aws_route_table_association.route_table_association_p01: Refreshing state... [id=rtbassoc-0796b2397c85d5cd0]
aws_route_table_association.route_table_association_p02: Refreshing state... [id=rtbassoc-0189e8a82c15e64c1]
aws_route_table.private_route_table_01: Refreshing state... [id=rtb-0d55c907c5b3035ce]
aws_route_table.private_route_table_02: Refreshing state... [id=rtb-03307f6531b2cde84]
aws_route_table_association.route_table_association_i01: Refreshing state... [id=rtbassoc-0662be9edc3b7bd38]
aws_route_table_association.route_table_association_i02: Refreshing state... [id=rtbassoc-00ce69c3b4879d799]
aws_eks_identity_provider_config.oidc: Refreshing state... [id=earth-dev:earth-dev]
aws_eks_node_group.app_node_group: Refreshing state... [id=earth-dev:app-node-group]
aws_eks_addon.kube-proxy: Refreshing state... [id=earth-dev:kube-proxy]
aws_eks_addon.vpc-cni: Refreshing state... [id=earth-dev:vpc-cni]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name           = "coredns"
      + addon_version        = "v1.10.1-eksbuild.4"
      + arn                  = (known after apply)
      + cluster_name         = "earth-dev"
      + configuration_values = jsonencode(
            {
              + replicaCount = 2
              + resources    = {
                  + limits   = {
                      + memory = "170Mi"
                    }
                  + requests = {
                      + cpu    = "100m"
                      + memory = "70Mi"
                    }
                }
            }
        )
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
    }

  # aws_eks_addon.kube-proxy is tainted, so must be replaced
-/+ resource "aws_eks_addon" "kube-proxy" {
      ~ arn                  = "arn:aws:eks:ap-northeast-2:318374019075:addon/earth-dev/kube-proxy/e4c59417-f210-765f-a3b8-844927a30419" -> (known after apply)
      + configuration_values = (known after apply)
      ~ created_at           = "2023-10-13T08:38:29Z" -> (known after apply)
      ~ id                   = "earth-dev:kube-proxy" -> (known after apply)
      ~ modified_at          = "2023-10-13T08:38:30Z" -> (known after apply)
      - tags                 = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_eks_node_group.app_node_group is tainted, so must be replaced
-/+ resource "aws_eks_node_group" "app_node_group" {
      ~ ami_type               = "CUSTOM" -> (known after apply)
      ~ arn                    = "arn:aws:eks:ap-northeast-2:318374019075:nodegroup/earth-dev/app-node-group/a6c59417-f001-edda-5a30-9b5233fa8752" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "earth-dev:app-node-group" -> (known after apply)
      ~ instance_types         = [] -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "ami-09af799f87c7601fa" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-app-node-group-a6c59417-f001-edda-5a30-9b5233fa8752"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
      - tags                   = {} -> null
      + version                = (known after apply)
        # (5 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0b5746690741556e7"
          ~ name    = "app_node_launch_template" -> (known after apply)
          ~ version = "1" -> (known after apply)
        }

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_launch_template.app_node will be updated in-place
  ~ resource "aws_launch_template" "app_node" {
        id                      = "lt-0b5746690741556e7"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "app_node_launch_template"
        tags                    = {}
      - user_data               = "TUlNRS1WZXJzaW9uOiAxLjAKQ29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSI9PU1ZQk9VTkRBUlk9PSIKCi0tPT1NWUJPVU5EQVJZPT0KQ29udGVudC1UeXBlOiB0ZXh0L3gtc2hlbGxzY3JpcHQ7IGNoYXJzZXQ9InVzLWFzY2lpIgoKIyEvYmluL2Jhc2ggLXhlCndnZXQgaHR0cHM6Ly9zMy5hbWF6b25hd3MuY29tL21vdW50cG9pbnQtczMtcmVsZWFzZS9sYXRlc3QveDg2XzY0L21vdW50LXMzLnJwbQpzdWRvIHl1bSBpbnN0YWxsIC15IC4vbW91bnQtczMucnBtCm1rZGlyIC1wIH4vbW50L3MzCm1vdW50LXMzIGFybjphd3M6czM6YXAtbm9ydGhlYXN0LTI6MzE4Mzc0MDE5MDc1OmVrcy1zaGFyZSB+L21udC9zMwoKLS09PU1ZQk9VTkRBUlk9PS0tCg==" -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jonghak-dev, Action: `pull_request`, Workflow: `Terraform apply`*